import React, { Component } from 'react'

export default class Talk extends Component {
  render() {
    return (
      <div>
        <img
          src={'./麻婆豆腐.jpg'}
          style={{ float: 'left', marginRight: '20px' }}
        />
        <h1>麻婆豆腐（拼音：má pó dòu fǔ；英文：sauteed tofu in hot and spicy sauce），是四川省传统名菜之一，属于川菜。</h1> 主要原料为配料和豆腐，材料主要有豆腐、牛肉末（也可以用猪肉）、辣椒和花椒等。麻来自花椒，辣来自辣椒，这道菜突出了川菜“麻辣”的特点。其口味独特，口感顺滑。
如今，麻婆豆腐远渡重洋，在美国、加拿大、英国、法国、越南、新加坡、马来西亚、日本、澳大利亚等国安家落户，从一味家常小菜一跃而登上大雅之堂，成了国际名菜。
2018年9月10日，“中国菜”正式发布，“麻婆豆腐“被评为“中国菜”四川十大经典名菜。
        <img
          src={'./麻婆豆腐3.jpg'}
          style={{ float: 'right', marginRight: '20px',width:'360px' }}
        />
      <b>历史起源</b> 
麻婆豆腐始创于清朝同治元年（1862年），在成都万福桥边，有一家原名“陈兴盛饭铺”的店面。店主陈春富（陈森富）早殁，小饭店便由老板娘经营，女老板面上微麻，人称"陈麻婆"。当年的万福桥是一道横跨府河，常有苦力之人在此歇脚、打尖。光顾饭铺的主要是挑油的脚夫。陈氏对烹制豆腐有一套独特的烹饪技巧，烹制出的豆腐色香味俱全，不同凡响，深得人们喜爱，她创制的烧豆腐，则被称为“陈麻婆豆腐”，其饮食小店后来也以“陈麻婆豆腐店”为名。
《锦城竹枝词》、《芙蓉话旧录》等书对陈麻婆创制麻婆豆腐的历史均有记述。《锦城竹枝词》云：“麻婆陈氏尚传名，豆腐烘来味最精，万福桥边帘影动，合沽春酒醉先生”。《成都通览》记载陈麻婆豆腐在清朝末年便被例为成都著名食品。
        <img
          src={'./麻婆豆腐2.jpg'}
          style={{ float: 'left', marginLeft: '20px',margin:'40px',width:'360px' }}
        />
    <h2> 流传变化</h2>
麻婆豆腐广受欢迎，流传各地，做法也有许多不同。最大的改变之一，是“陈兴盛饭铺”自己所调整，亦即将材料的牛肉改为猪肉，以便不吃牛肉的食客也能品尝。该店后来又改回用牛肉，但以猪肉为料的作法也已广为各地厨师和食客接受；其次则是增加了豆瓣酱
早期的麻婆豆腐用料是菜油和黄牛肉。烹饪手法是先在锅中将一大勺菜油煎熟，然后放一大把辣椒末，接着下牛肉，煮到干酥烂时再下豆豉。之后放入豆腐，稍微加水并铲几下调匀，最后盖上锅盖用小火将汤汁收干，起锅前再洒上花椒末。
二十世纪六十年代，制作麻婆豆腐时，油必用花生油，肉则不拘牛猪。肉炒熟后，加入豆瓣酱、豆豉、红椒粉、酱油、盐、糖，爆香后再加入豆腐片、高汤，滚煮后加入葱、姜、蒜，以水调太白粉勾芡，起锅前加花椒粉和麻油。作料与程序已有些变化，口味强调麻、辣、烫、咸。
        <img
          src={'./麻婆豆腐3.jpg'}
          style={{ float: 'right', marginRight: '20px', width:'400px'}}
        />
       <h1>做法窍门</h1>

1.豆腐切块后，用沸腾的淡盐水焯水，可以去除豆腐涩味，保持豆腐口感细嫩，且不易碎；如用开水煮过，会韧劲过大、口感不好；
2.豆瓣酱里的豆瓣最好能先切细；
3.肉末抄前，最好用料酒、食盐腌渍20分钟；
4.花椒先用锅炒香，碾碎，最后趁热撒在豆腐上，这样更能提升香热麻辣的口感；
5.豆腐要嫩又不易碎，以南豆腐做麻婆豆腐为佳。
<h1>食用功效</h1>
1.此菜富含动植物蛋白质、钙、磷、铁、维生素及碳水化合物
，具有温中益气、补中生津、解毒润燥、补精添髓的功效。
2.此菜夏天食用能生津止渴、健脾，有利健身防病。麻婆豆腐也是高血压、高血脂、高胆固醇症及动脉硬化、冠心病患者的佳肴。
3.豆腐为补益、清热养生食品，常食补中益气，清热润燥，生津止渴，清洁肠胃，解毒化湿，更适于热生体质，口臭口渴，肠胃不清，热病后调养者食用。
4.此菜富含动植物蛋白质、钙、磷、铁、维生素及碳水化合物，具有温中益气、补中生津、解毒润燥、补精添髓的功效。
5.豆腐和鱼同食，能够更好的吸收鱼中的动物蛋白。
        <img
          src={'./麻婆豆腐4.jpg'}
          style={{ float: 'left', marginRight: '20px',marginTop:'50px' ,width:'550px' }}
        />
        
      <h1 style={{ marginTop:'50px'  }}><b>典故传说</b></h1> 
      <h1>关于麻婆豆腐，相传最广的故事是这样的。</h1> 

清朝末期，成都万福桥码头旁边有一家小馆子，老板娘脸上有麻子，人们都叫她陈麻婆。同治元年（1862年），陈麻婆接待了一批又一批的码头工人、脚夫，店里的东西已经不多了。都快打烊的时候，又进来了一伙，要求老板做点又下饭，又热和又便宜的菜。陈麻婆看店里没什么菜，只剩下几盘豆腐，一点牛肉末，现去买菜肯定不行，已经太晚了。陈麻婆急中生智，把豆瓣剁细，加上豆豉，放油锅里炒香。加点汤，放下切成两厘米见方的豆腐块，再配上其他调料，加入炸酥脆的牛肉末，勾芡收汁，起锅以后再来上一把花椒面辣椒面洒在豆腐上。一盆色鲜味美，麻、辣、烫、囫、嫩、鲜的豆腐就上桌了。这一伙人个个吃得鼻子冒汗，整了好几碗饭，吃得肚儿溜圆，口中大呼畅快。后来那些苦哈哈的民众开始一传十，十传百，都晓得陈麻婆做的豆腐又好吃，又下饭，又省钱，来的人越来越多，结果，就成了陈家的招牌菜。因为这种豆腐又麻又辣，老板娘又叫陈麻婆，结果这道豆腐菜就叫陈麻婆豆腐了。成都北门顺河街，是一片木材集中地，遍街之上，几乎家家都是木行，即使有三家两家，做的不是木材生意，但也依赖木材过活。
原来麻婆娘家姓温，是北门火神庙万丰酱园大掌柜的七姑娘，小名巧巧。她上有三个哥哥，三个姊姊，个个资质平庸。唯有巧巧长大了以后，反而出落得芙蓉如面柳如眉。有着一双水汪汪的眼睛和玲珑有致的身材，可是老天偏弄促狭，在她粉脸上洒下一些白麻子，但她麻得娇，麻得俏。

十七岁那年，嫁给顺记木材行四掌柜陈志灏。新婚以后，小俩口恩爱异常，正因如此，大嫂二嫂在嫉妒中，就有意无意的散播些谗言蜚语。时间长了，原来对她颇为疼爱的婆婆，也慢慢的由冷落而加以责骂了。
她的三哥三嫂，从前也是受不住婆婆嫂嫂的冷言讽语而远走高飞，在那数百里外的重庆，另外开了一家药房。大概是受了这两人的影响，夫妻暗暗商量妥当，分得了少数现金和三间街房，也离开了陈家老窝。
三间街房自家住了一间，另两间仍然续租给原本的一家羊肉店和一家豆腐坊。四掌柜的就到廿里外的马家碾，替一家榨房当起管事，每天早出晚归。白天她用针线打发寂寞，终日紧闭门户，过着甜甜蜜蜜的岁月。
第二年的春天，她的小姑淑华，因为和二嫂吵嘴，赌气离开了爹娘，投靠她的四嫂。从此姑嫂相依，日子有了欢声笑语。马家碾一带，尽是油坊。成都附近的三角地带的人，多半从事油菜的种植与榨油，称为菜子，这些菜子，又多半集中在马家碾榨油。四掌柜生性和善，待人亲切诚恳，一两年后，他已由秤油、发油的管事，升为采购、推销及收款员了。只要是他经手的事件，对那些穷苦挑夫异常体恤、仁慈，绝不使苦力白赔血汗。
她家住的地方是马家碾进城必经之路，那些挑夫大都把这儿当成中继站，他们为了感念四掌柜的待人厚道，经常送点自家的小东西回报。虽然他俩再三推辞，但是穷苦的人，礼轻仁义重，于是收了之后，巧巧总是左边店里买点羊肉，右边店里买点豆腐烧上一盘，再配两样小菜回赠。
这样的幸福生活，刚刚度过了十年，不幸的命运却降在她身上，光绪二十七年七月十五日，四掌柜在金堂马家渡翻了船，从此她失去了心爱的丈夫，从此她幻灭了人生的美梦。
淑华看她孤苦伶仃，加上十年相依的情感，虽然自己都十九岁了，不舍得离弃处于困境又极为疼爱自己的四嫂而出嫁。当然出了这种状况之后，陈家、温家都曾派人要接她俩回去，但都被她们严词拒绝，她俩知道那碗闲饭，并不容易享受。

刚开始，娘家婆家虽然也有些微的接济，但是杯水车薪，姑嫂俩为了生活，不得不面对现实，打开门户，为生计而打拼。她俩都做得一手好针线，能剪会裁，可附近人家，都非豪门钜富，除了过年，平时很少添制衣物，想专靠这门手艺吃饭，不上算。
幸好这个中继站每天依旧人来人往，那些种植、榨油的「菜子」，卖苦力的油担子「挑夫」，不管是过去熟识或才见面，全都感念以往四掌柜的善待，看她们打开店铺，每天仍来歇脚。有些带点米，有些带点菜，空手的就在隔壁两家店，买点羊肉、豆腐，洗洗弄弄，等巧巧来上锅一烧，就可饱餐一顿。大家故意省下一口，就足够姑嫂早晚两餐而有馀。
这些诚挚的情谊，不但鼓舞了巧巧枯萎的心灵，而且更使她练就出一种专烧豆腐的绝技。在众口宣扬声中，巧巧所做的臊子（羊肉）豆腐美名，竟然传遍了川西一府十馀县。凡是过去认得四掌柜的，总是想方设法，提点礼物上门看望，目的仅在一嚐她的烧豆腐手艺。四掌柜的老东家，认为巧巧姑嫂既然都表明守贞不嫁，又不愿返回娘婆二家，再三劝巧巧继子成祧（继承为后嗣），以娱晚景，并好意借予资金帮助她开店当炉，一展烹调专长。
那时正是光绪卅年，社会风气保守，妇女抛头露面，也不免旁人指摘。温陈两家亲友认为是奇耻大辱，陆续登门，一力劝阻，但她俩意志坚定，店日日照样开，豆腐仍天天烧。后来乾脆向两家声明，只要拿出五千两银子「生息」，她就关店歇业。提到要钱，兄弟妯娌就只好闭口裹脚。

从此姑嫂打起精神，一心一意招呼生意，嫂嫂剁肉烧菜，小姑擦桌洗碗。她俩行得正，坐得端，长期事实表现，人们内心才慢慢由轻视而转变为敬重了。宣统二年，她三哥把十二岁的次子带回成都，正式过继给巧巧为子，可惜因为不是自己亲生又忙于生意疏于关爱，结果十六岁那年，偷偷跑上部队当了一名副官。
就这样，年复一年的，店面扩大了，生意兴隆了，但她俩的青春也就在「一双小小的金莲」，急速的挪移中慢慢的流逝了。为了避免闲言，店中「一无应门五尺之童」。豆腐、羊肉，要客人自行购买，客人所付火费、饭钱，姑嫂多寡不争。她俩由于操劳过度，民国二十三年（1934年），淑华首先病倒，万不得已找了一位远房族孙前来帮忙。结果一年之间，姑嫂先后去世。
生前，有人叫她巧姑娘、四少奶；又有些人叫她陈四嫂、掌柜娘。麻婆是她死后挣出来的招牌：麻，是别人对她美丽娇俏的怀念；婆，是别人对她年高德邵的尊称
       
      </div>
    )
  }
}
