import React, { Component } from 'react'

export default class Happy extends Component {
  render() {
    return (
      <div>
        <img
          src={'./东坡肉.jpg'}
          style={{ float: 'left', marginRight: '20px' }}
        />
       <h1>东坡肉，又名滚肉、东坡焖肉，是眉山和江南地区特色传统名菜。</h1> 东坡肉在浙菜、川菜、鄂菜等菜系中都有，且各地做法也有不同，有先煮后烧的，有先煮后蒸的，有直接焖煮收汁的。
东坡肉的主料和造型大同小异，主料都是半肥半瘦的猪肉，成品菜都是码得整整齐齐的麻将块儿，红得透亮，色如玛瑙，夹起一块尝尝，软而不烂，肥而不腻。
东坡肉相传为北宋词人苏东坡（四川眉山人）所创制（实为其小妾王朝云创制（苏被贬黄州之际王为改善其饮食所创）），最早发源地是四川眉山。原型是徐州回赠肉， 为徐州“东坡四珍”之一。
宋神宗熙宁十年（1077年）四月，苏轼赴任徐州知州。七月七日，黄河在澶州曹村埽一带决口，至八月二十一日洪水围困徐州，水位竟高达二丈八尺。苏轼以身卒之，亲荷畚插，率领禁军武卫营，和全城百姓抗洪筑堤保城。经过七十多个昼夜的艰苦奋战，终于保住了徐州城。全城百姓无不欢欣鼓舞，他们为感谢这位领导有方，与徐州人民同呼吸、共存亡的好知州，纷纷杀猪宰羊，担酒携菜上府慰劳。苏轼推辞不掉，收下后亲自指点家人制成红烧肉，又回赠给参加抗洪的百姓。百姓食后，都觉得此肉肥而不腻、酥香味美，一致称他为“回赠肉”。此后，“回赠肉”就在徐州一带流传，并成徐州传统名菜。这在《徐州文史资料》、《徐州风物志》、《徐州古今名馔》中都有记述。
        <img
          src={'./东坡肉1.jpg'}
          style={{ float: 'right', marginLeft: '20px' }}
          
        />
        　　<h1>菜品特色</h1>
        一般选用半肥半瘦的猪肉，切成约二寸许的方正形猪肉做食材。
成菜后，薄皮嫩肉，色泽红亮，味醇汁浓，酥烂而形不碎，香糯而不腻口
<h3>食用须知</h3>
营养价值
猪肉富含铜，对于血液、中枢神经和免疫系统，肾等内脏的发育和功能有重要影响。富含脂肪，维持体温和保护内脏，提供必需脂肪酸，促进这些脂溶性维生素的吸收，增加饱腹感。含有丰富的优质蛋白质。提供血红素（有机铁）和促进铁吸收的半胱氨酸，能改善缺铁性贫血。
        <img
          src={'./东坡肉2.jpg'}
          style={{ float: 'left', marginRight: '20px' }}
        />
        　　<h1 style={{color:'red'}}>注意事项</h1>
选购时，粘连在一起的猪肉不要买。包装袋中冰晶多的不要买。置于冰柜外层的不要买。
另外，猪肉不宜与乌梅、甘草、鲫鱼、虾、鸽肉、田螺、杏仁、驴肉、羊肝、香菜、甲鱼、菱角、荞麦、鹌鹑肉、牛肉同食。食用猪肉后不宜大量饮茶。
   <h3>历史文化</h3>
   <h2>传说一</h2>
宋朝文
学家苏东坡，他云游四海来到永修境内一个叫艾城的地方。三伏天，苏东坡救了一个中暑的小孩。作为农夫的父母，买了两斤猪肉，用一束稻草捆着提了回来，想问苏先生的口味。恰巧，苏东坡正在赋诗填词，口中朗朗念着：“禾------草-------珍---------珠-------透心香......”。农夫听了一楞，仔细琢磨，认为是让他把肉和着稻草整煮，并要煮透心。吃饭时，菜端上桌来，苏东坡见一块整肉，没斫没切，还用稻草捆着，不知什么原因，又不好意思开口。农夫挺奇怪，就对苏东坡说：“早上我去问你，你不是说‘和草整煮透心香’吗？我是按照你的意思给弄的，先生怎么不吃呢？”苏东坡恍然大悟，也只好顺坡下驴。没想到猪肉掺杂着稻草香味，十分清香可口。吃完饭，农夫夫妇出门去了。东坡想：主人如此盛情款待，打扰几天了，十分过意不去。几次要走，主人都不肯，今天还是走了吧。主意一定，从包袱里取出五两纹银，放在桌子上，留下一张字条，上写着：“主人盛情难却，东坡不辞而别。”农夫夫妇回来，看见条子大吃一惊，原来救自己孩子的恩人竟是鼎鼎大名的苏东坡先生。
这事一传十，十传百，大家都学着用稻草扎肉煮着吃，果然香酥可口。乡亲们便把这种肉称作“东坡肉”。因其味道鲜美，做法别致，所以一直流传。
<h2>传说二</h2>
据传苏东坡在杭州做官时，组织民工在西湖筑了一道堤，为老百姓做了一件好事。为了感谢苏东坡，那年过春节，城里男女老少抬猪担酒来给他拜年。盛情难却，苏东坡便收下了猪肉。后来，他叫人将猪肉切成方块，烧得红酥酥的，然后按民工的花名册，挨家挨户把肉分送给他们过年。老百姓看到苏东坡不忘民工，越发爱戴他，把他送来的肉叫“东坡肉”。吃起东坡肉来更觉味道鲜美。
那时杭州有家大菜馆，菜馆老板见人们夸说东坡肉好，就和厨师商量，也把肉切成方块，烧得红酥酥的，挂出“东坡肉”的牌子。牌子一挂出来，那家菜馆的生意就兴隆极了，从早到晚，顾客不断。每天杀十头大肥猪都不够卖。别的菜馆看得眼红，也都学着做了起来。一时间，大小菜馆家家上市东坡肉。

再说苏东坡为人正直，不畏权贵，朝廷中的一班奸臣对他恨得咬牙切齿，听说他受到杭州老百姓爱戴，心里更不舒服。他们当中有个御史，乔装打扮到杭州，存心来找苏东坡的岔子。御史到了杭州，在一家饭馆吃饭。堂倌递上菜单请他点菜。他接过来一看，头一样菜就是“东坡肉”。于是他皱起眉头想了想，不觉高兴得拍着桌子大叫：“我就要点这个菜。”他吃过东坡肉，觉得味道真是不错，向堂倌一打听，知道东坡肉家家菜馆都有。于是，就把杭州所有菜馆的菜单，统统收集来，之后，便兴冲冲地回京去了。御史回到京城，马上就去见皇帝，说：“皇上呀，苏东坡在杭州贪赃枉法，坏事做绝，老百姓恨不得要吃他的肉！”皇帝问：“你怎么知道？可有什么证据？”御史就把那一大沓油腻腻的菜单呈了上去。皇帝本来就是个糊涂蛋，他一看菜单，也不分青红皂白，立刻传下一道圣旨，将苏东坡革掉官职，发配到海南去。
苏东坡革职充军之后，杭州的老百姓忘不了他的好处，仍像过去一样赞扬他，把他疏浚西湖筑的堤称为“苏堤”，还把东坡肉公推为杭州第一道名菜
      </div>
    )
  }
}
